jmeter/JDH-Combined-JMeter-and-Selenium.yaml

# Script generated by Blazemeter Chrome Extension

modules:
  nose:
    ignore-unknown-actions: true

execution:
- executor: selenium
  scenario: JDH-Selenium
  blazegrid: true
  
  capabilities: 
    browserName: chrome
  hold-for: 20m

- executor: jmeter
  scenario: JDH-Http
  concurrency: 20
  ramp-up: 1m
  hold-for: 19m

scenarios:
  JDH-Selenium:
    generate-flow-markers: true 
    headless: false
    timeout: 60s
    think-time: 0s
    requests:
    - label: Test
      actions:
      - resizeWindow(1440,710)
      - go(http://10.240.4.179/en/)
      - clickByLinkText(Issues)
    - label: issues
      actions:
      - clickByCSS(h3.d-block.mt-3.pb-0)
    - label: jdh001
      actions:
      - clickByCSS(div.col-md-4.offset-md-0 > div.IssueArticleGridItem.mt-5 > a > h3.d-block.mt-3.pb-0)
    - label: article
      actions:
      - clickByLinkText(Abstract Submission)

  JDH-Http:
    headers:
      Accept: 'application/json, text/plain, */*'
      User-Agent: 'Mozilla/5.0 (Macintosh; Intel Mac OS X 10_15_4) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/91.0.4472.114 Safari/537.36'
    requests:
      - transaction: Test
        force-parent-sample: false
        do:
          - url: 'http://10.240.4.179/api/issues'
            method: GET
            label: 'http://10.240.4.179/api/issues'
            headers: {}
            body:
              ordering: '-creation_date'
      - transaction: issues
        force-parent-sample: false
        do:
          - url: 'http://10.240.4.179/api/issues/jdh001'
            method: GET
            label: 'http://10.240.4.179/api/issues/jdh001'
            headers: {}
          - url: 'http://10.240.4.179/api/articles/'
            method: GET
            label: 'http://10.240.4.179/api/articles/'
            headers: {}
            body:
              pid: jdh001
      - transaction: jdh001
        force-parent-sample: false
        do:
          - url: 'http://10.240.4.179/api/articles/WBqfZzfi7nHK'
            method: GET
            label: 'http://10.240.4.179/api/articles/WBqfZzfi7nHK'
            headers: {}
          - url: 'http://10.240.4.179/proxy-githubusercontent/jdh-observer/jdh001-WBqfZzfi7nHK/main/scripts/Digital_epigraphy_cite2c_biblio.ipynb'
            method: GET
            label: 'http://10.240.4.179/proxy-githubusercontent/jdh-observer/jdh001-WBqfZzfi7nHK/main/scripts/Digital_epigraphy_cite2c_biblio.ipynb'
            headers: {}